Revit 2027 API
ElementMulticategoryFilter(ICollection<ElementId>, Boolean) Constructor
 Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to instead match elements which are not of the given categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementMulticategoryFilter(
	ICollection<ElementId> categoryIds,
	bool inverted
)
Public Sub New (
	categoryIds As ICollection(Of ElementId),
	inverted As Boolean
)
public:
ElementMulticategoryFilter(
	ICollection<ElementId^>^ categoryIds,
	bool inverted
)
new :
        categoryIds : ICollection<ElementId> *
        inverted : bool -> ElementMulticategoryFilter
Parameters
categoryIds ICollection<ElementId>
 The category ids to match.
inverted Boolean
 True if the filter should match all elements which are not of the given categories.
Exceptions
Exception | Condition
ArgumentException |  One or more categories was not valid for filtering.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace